Revit 2027 API
DuctFittingAndAccessoryPressureDropUIData Methods
The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.
Methods
Name | Description
Dispose
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
GetUIDataItems |  Gets all UI data items stored in the UI data.
GetUnits |  Gets units.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DuctFittingAndAccessoryPressureDropUIData Class
Autodesk.Revit.UI.Mechanical Namespace